###############################################################################
# Copyright (c) 2001, 2004 IBM Corporation and others.
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
# 
# Contributors:
# IBM Corporation - initial API and implementation
###############################################################################
subclass_responsibilty_EXC_=IWAE0001E {0} deve ser implementado na subclasse
key_class_reflection_ERROR_=IWAE0002E N\u00e3o \u00e9 poss\u00edvel refletir a classe "{0}" para comparar o campo de chave principal "{1}" a partir da entidade "{2}"
key_field_reflection_ERROR_=IWAE0003E N\u00e3o \u00e9 poss\u00edvel refletir o tipo de campo de chave principal "{0}" a partir da entidade "{1}"
removing_key_field_INFO_=IWAE0004I Removendo campo de chave principal inv\u00e1lida "{0}" da entidade "{1}"
repair_usage_ERROR_=IWAE0005E Uso de RepairArchiveCommand: n\u00e3o \u00e9 poss\u00edvel gravar em destinationPath: {0}
invalid_archive_EXC_=IWAE0006E O archive n\u00e3o \u00e9 um {0} v\u00e1lido porque o descritor de implementa\u00e7\u00e3o n\u00e3o foi encontrado (distin\u00e7\u00e3o entre mai\u00fasculas e min\u00fasculas): {1}
load_resource_EXC_=IWAE0007E N\u00e3o foi poss\u00edvel carregar o recurso "{0}" no archive "{1}"
nested_jar_EXC_=IWAE0008E Ocorreu um erro ao ler {0} a partir de {1}
make_temp_dir_EXC_=IWAE0009E N\u00e3o \u00e9 poss\u00edvel criar diret\u00f3rio temp: {0}
invalid_classpath_WARN_=IWAE0010W O elemento do classpath "{0}" n\u00e3o \u00e9 um diret\u00f3rio ou um arquivo Zip
invalid_cp_file_WARN_=IWAE0011W O elemento do classpath "{0}" n\u00e3o aponta para um arquivo local
io_ex_loading_EXC_=IWAE0012E Ocorreu uma exce\u00e7\u00e3o ES ao carregar {0}
tx_bean_mgd_WARN_=IWAE0013W Importa\u00e7\u00e3o de EJB 1.0: N\u00e3o mapear descritor de controle TX_BEAN_MANAGED para {0}
error_saving_EXC_=IWAE0014E Erro ao salvar {0}
io_ex_manifest_EXC_=IWAE0015E Ocorreu uma exce\u00e7\u00e3o ES ao ler o manifesto no archive: {0}
io_ex_reopen_EXC_=IWAE0016E Ocorreu uma exce\u00e7\u00e3o ES ao reabrir {0}
unable_replace_EXC_=IWAE0017E N\u00e3o \u00e9 poss\u00edvel substituir o archive original: {0}
duplicate_file_EXC_=IWAE0018E O archive {0} j\u00e1 cont\u00e9m um arquivo denominado {1}
duplicate_entry_EXC_=IWAE0019E O arquivo ou recurso com o uri {0} j\u00e1 existe no archive denominado {1}
file_exist_as_dir_EXC_=IWAE0020E O arquivo {0} existe e \u00e9 um diret\u00f3rio
uncontained_module_EXC_=IWAE0021E O m\u00f3dulo {0} n\u00e3o \u00e9 contido por um arquivo EAR
dd_in_ear_load_EXC_=IWAE0022E Ocorreu uma exce\u00e7\u00e3o ao carregar o descritor de implementa\u00e7\u00e3o para o m\u00f3dulo "{0}" no arquivo EAR "{1}"
nested_open_fail_EXC_=IWAE0023E N\u00e3o \u00e9 poss\u00edvel abrir o arquivo de m\u00f3dulo "{0}" no arquivo EAR "{1}"
duplicate_module_EXC_=IWAE0024E O descritor de implementa\u00e7\u00e3o para o arquivo EAR "{0}" j\u00e1 cont\u00e9m um m\u00f3dulo que possui uri "{1}"
no_sec_role_EXC_=IWAE0025E {0}: O descritor de implementa\u00e7\u00e3o do Arquivo EAR n\u00e3o cont\u00e9m uma fun\u00e7\u00e3o de seguran\u00e7a denominada {1}
dup_sec_role_EXC_=IWAE0026E {0}: O descritor de implementa\u00e7\u00e3o do Arquivo EAR j\u00e1 cont\u00e9m uma fun\u00e7\u00e3o de seguran\u00e7a denominada {1}
dup_sec_role_module_EXC_=IWAE0027E O descritor de implementa\u00e7\u00e3o para {0} j\u00e1 cont\u00e9m uma fun\u00e7\u00e3o de seguran\u00e7a denominada {1}
dup_resource_EXC_=IWAE0028E O recurso denominado "{0}" j\u00e1 existe no archive "{1}"
error_saving_EXC_=IWAE0030E Erro ao salvar {0}
add_copy_class_dir_EXC_=IWAE0031E O m\u00e9todo "addCopyClass" n\u00e3o \u00e9 suportado para diret\u00f3rios. URI: {0}
add_copy_lib_dir_EXC_=IWAE0032E O m\u00e9todo "addCopyLib" n\u00e3o \u00e9 suportado para diret\u00f3rios. URI: {0}
list_components_war_EXC_=IWAE0033E Ocorreu uma exce\u00e7\u00e3o ao listar componentes no arquivo WAR: {0}
open_nested_EXC_=IWAE0034E N\u00e3o foi poss\u00edvel abrir o archive aninhado "{0}" em "{1}"
make_temp_file_WARN_=IWAE0035W Aviso: N\u00e3o \u00e9 poss\u00edvel criar arquivo temp para {0}.  Isto causar\u00e1 impacto no desempenho.
file_not_found_EXC_=IWAE0036E Nome do URI: {0}; Nome do arquivo: {1}
could_not_open_EXC_=IWAE0037E N\u00e3o foi poss\u00edvel abrir {0}
could_not_find_dir_EXC_=IWAE0038E N\u00e3o \u00e9 poss\u00edvel abrir o diret\u00f3rio {0}
not_a_dir_EXC_=IWAE0039E N\u00e3o \u00e9 poss\u00edvel abrir o diret\u00f3rio porque o arquivo n\u00e3o \u00e9 um diret\u00f3rio: {0}
inferred_dds_EXC_=IWAE0040E Sup\u00f4s-se que o arquivo JAR EJB "{0}" tinha a vers\u00e3o 1.0, porque o manifesto n\u00e3o declara os beans corporativos, mas descritores de implementa\u00e7\u00e3o serializados existem no JAR.
filename_exception_EXC_=IWAE0041E Nome do arquivo: {0}; Exce\u00e7\u00e3o: {1}
no_dds_10_EXC_=IWAE0042E N\u00e3o h\u00e1 descritores de implementa\u00e7\u00e3o no arquivo JAR EJB 1.0: {0}
manifest_dd_load_EXC_=IWAE0043E O manifesto JAR declara um bean corporativo para o qual o descritor de implementa\u00e7\u00e3o n\u00e3o pode ser carregado: {0}
manifest_dd_find_EXC_=IWAE0044E O manifesto JAR declara um bean corporativo para o qual o descritor de implementa\u00e7\u00e3o n\u00e3o pode ser encontrado: {0}
io_ex_reading_dd_EXC_=IWAE0045E Ocorreu uma Exce\u00e7\u00e3o ES ao ler {0}
ser_not_dd_EXC_=IWAE0046E O objeto serializado no arquivo "{0}" n\u00e3o \u00e9 uma inst\u00e2ncia de javax.ejb.deployment.DeploymentDescriptor
reading_dd_EXC_=IWAE0047E Ocorreu uma Exce\u00e7\u00e3o ao ler {0}
missing_class_EXC_=IWAE0048E N\u00e3o foi poss\u00edvel desserializar {0} porque uma classe requerida n\u00e3o p\u00f4de ser encontrada. Exce\u00e7\u00e3o: {1}
Converted=Convertido
Stack_trace_of_nested_exce_EXC_=IWAE0049E Rastreio de exce\u00e7\u00e3o aninhada:
IOException_occurred_while_EXC_=IWAE0050E Ocorreu uma Exce\u00e7\u00e3o ES ao copiar o manifesto
Extract_destination_is_the_EXC_=IWAE0051E O destino da extra\u00e7\u00e3o \u00e9 o mesmo caminho que o arquivo de origem
Parameter_should_not_be_nu_EXC_=IWAE0052E O par\u00e2metro n\u00e3o deve ser nulo
Archive_is_not_a_valid_EJB_EXC_=IWAE0055E O archive n\u00e3o \u00e9 um arquivo JAR EJB v\u00e1lido (1.0) porque nenhum descritor de implementa\u00e7\u00e3o serializado pode ser encontrado no manifesto ou nas entradas com uma extens\u00e3o ".ser"
_The_following_files_could_EXC_=IWAE0056E Os arquivos a seguir n\u00e3o puderam ser carregados:
FixPrimKeyCommand_failed_-_EXC_=IWAE0057E FixPrimKeyCommand falhou - rastreio da pilha de exce\u00e7\u00e3o:
FixPrimKeyCommand_usage___=Utiliza\u00e7\u00e3o de FixPrimKeyCommand:  <sourceJarFilePath> [destinationPath]
FixPrimKeyCommand_usage__s_EXC_=IWAE0058E Uso de FixPrimKeyCommand: sourceJarFilePath deve apontar para um arquivo JAR EJB v\u00e1lido ou diret\u00f3rio de um arquivo JAR EJB expandido
Repair_command_failed_-_ex_EXC_=IWAE0059E Falha no comando Reparar - rastreio da pilha de exce\u00e7\u00e3o:
Repairs_all_entries_in_the=Repara todas as entradas nos diret\u00f3rios META-INF e/ou WEB-INF para que elas estejam com a caixa correta
RepairArchiveCommand_usage=Utiliza\u00e7\u00e3o de RepairArchiveCommand:  <sourceJarFilePath> <destinationPath>
RepairArchiveCommand_usage1_ERROR_=IWAE0060E Uso de RepairArchiveCommand: sourceJarFilePath deve apontar para um archive v\u00e1lido ou diret\u00f3rio de um archive expandido
Application_Client_Jar_Fil=Arquivo JAR do Cliente do Aplicativo
EAR_File=Arquivo EAR
EJB_Jar_File=Arquivo JAR EJB
RAR_File=Arquivo RAR
WAR_File=Arquivo WAR
Error_occurred_iterating_f_EXC_=IWAE0061E Ocorreu um erro ao iterar arquivos
End_of_list_reached_EXC_=IWAE0062E Alcan\u00e7ado o fim da lista
Internal_Error__Iterator_o_EXC_=IWAE0063E Erro Interno: Iterador n\u00e3o sincronizado com entradas zip
Error_iterating_the_archiv_EXC_=IWAE0064E Erro ao iterar o archive
Absolute_path_unknown_EXC_=IWAE0065E Caminho absoluto desconhecido
Original_archive_is_not_a__EXC_=IWAE0066E O archive original n\u00e3o \u00e9 um diret\u00f3rio
Null_uri_EXC_=IWAE0067E Uri nulo
Module_file=Arquivo de m\u00f3dulo
A_WAR_file=Arquivo WAR
An_EJB_JAR_file=Arquivo JAR EJB
An_Application_Client_JAR_file=Arquivo JAR do Cliente do Aplicativo
A_RAR_file=Arquivo RAR
A_Application_file=Arquivo do Aplicativo
A_file_does_not_exist_for_module=Um arquivo n\u00e3o existe para o elemento de m\u00f3dulo que possui a uri: {0}
File_not_correct_type=O arquivo {0} no arquivo EAR {1} n\u00e3o \u00e9 o tipo correto, baseado no descritor de implementa\u00e7\u00e3o de aplicativo. Tipo estendido: {2}";
Module_not_in_EAR=O m\u00f3dulo n\u00e3o est\u00e1 em uma EAR: {0}
Module_file_does_not_exist_2=O arquivo de m\u00f3dulo n\u00e3o existe para a refer\u00eancia de M\u00f3dulo. M\u00f3dulo = {0}
FileImpl._Error_0=Conten\u00e7\u00e3o recursiva n\u00e3o permitida para
