###############################################################################
# Copyright (c) 2001, 2004 IBM Corporation and others.
# All rights reserved. This program and the accompanying materials
# are made available under the terms of the Eclipse Public License v1.0
# which accompanies this distribution, and is available at
# http://www.eclipse.org/legal/epl-v10.html
# 
# Contributors:
# IBM Corporation - initial API and implementation
###############################################################################
subclass_responsibilty_EXC_=IWAE0001E {0} debe implementarse en la subclase
key_class_reflection_ERROR_=IWAE0002E No se puede reflejar la clase "{0}" para poder comparar el campo de clave primaria "{1}" de la entidad "{2}"
key_field_reflection_ERROR_=IWAE0003E No se puede reflejar el tipo del campo de clave primaria "{0}" de la entidad "{1}"
removing_key_field_INFO_=IWAE0004I Eliminando campo de clave primaria no v\u00e1lido "{0}" de la entidad "{1}"
repair_usage_ERROR_=IWAE0005E Uso de RepairArchiveCommand: no se puede escribir en destinationPath: {0}
invalid_archive_EXC_=IWAE0006E El archivador no es un {0} v\u00e1lido ya que el descriptor de despliegue no puede encontrarse (sensible a may\u00fasculas y min\u00fasculas): {1}
load_resource_EXC_=IWAE0007E No se ha podido cargar el recurso "{0}" en el archivador "{1}"
nested_jar_EXC_=IWAE0008E Se ha producido un error al leer {0} desde {1}
make_temp_dir_EXC_=IWAE0009E No se puede crear el directorio temporal: {0}
invalid_classpath_WARN_=IWAE0010W El elemento de la v\u00eda de acceso de clases "{0}" no es un directorio ni un archivo Zip
invalid_cp_file_WARN_=IWAE0011W El elemento de la v\u00eda de acceso de clases "{0}" no apunta a un archivo local
io_ex_loading_EXC_=IWAE0012E Se ha producido una excepci\u00f3n de E/S al cargar {0}
tx_bean_mgd_WARN_=IWAE0013W Importaci\u00f3n de EJB 1.0: El descriptor de control TX_BEAN_MANAGED no se correlaciona para {0}
error_saving_EXC_=IWAE0014E Error al guardar {0}
io_ex_manifest_EXC_=IWAE0015E Se ha producido una excepci\u00f3n de E/S al leer el manifiesto en el archivador: {0}
io_ex_reopen_EXC_=IWAE0016E Se ha producido una excepci\u00f3n de E/S al reabrir {0}
unable_replace_EXC_=IWAE0017E No se puede sustituir el archivador original: {0}
duplicate_file_EXC_=IWAE0018E El archivador denominado {0} ya contiene un archivo denominado {1}
duplicate_entry_EXC_=IWAE0019E Un archivo o recurso con el uri {0} ya existe en el archivador denominado {1}
file_exist_as_dir_EXC_=IWAE0020E Existe un archivo denominado {0} y es un directorio
uncontained_module_EXC_=IWAE0021E El m\u00f3dulo {0} no est\u00e1 contenido dentro de un archivo EAR
dd_in_ear_load_EXC_=IWAE0022E Se ha producido una excepci\u00f3n al cargar el descriptor de despliegue para el m\u00f3dulo "{0}" en el archivo EAR "{1}"
nested_open_fail_EXC_=IWAE0023E No se puede abrir el archivo de m\u00f3dulo "{0}" en el archivo EAR "{1}"
duplicate_module_EXC_=IWAE0024E El descriptor de despliegue del archivo EAR "{0}" ya contiene un m\u00f3dulo que tiene el uri "{1}"
no_sec_role_EXC_=IWAE0025E {0}: El descriptor de despliegue del archivo EAR no contiene un cometido de seguridad denominado {1}
dup_sec_role_EXC_=IWAE0026E {0}: El descriptor de despliegue del archivo EAR ya contiene un cometido de seguridad denominado {1}
dup_sec_role_module_EXC_=IWAE0027E El descriptor de despliegue de {0} ya contiene un cometido de seguridad denominado {1}
dup_resource_EXC_=IWAE0028E El recurso denominado "{0}" ya existe en el archivador "{1}"
error_saving_EXC_=IWAE0030E Error al guardar {0}
add_copy_class_dir_EXC_=IWAE0031E El m\u00e9todo "addCopyClass" no est\u00e1 soportado para directorios. URI: {0}
add_copy_lib_dir_EXC_=IWAE0032E El m\u00e9todo "addCopyLib" no est\u00e1 soportado para directorios. URI: {0}
list_components_war_EXC_=IWAE0033E Se ha producido una excepci\u00f3n al listar componentes del archivo WAR: {0}
open_nested_EXC_=IWAE0034E No se ha podido abrir el archivador anidado "{0}" en "{1}"
make_temp_file_WARN_=IWAE0035W Aviso: No se puede crear el archivo temporal para {0}.  Esto afectar\u00e1 al rendimiento.
file_not_found_EXC_=IWAE0036E Nombre de URI: {0}; Nombre de archivo: {1}
could_not_open_EXC_=IWAE0037E No se ha podido abrir {0}
could_not_find_dir_EXC_=IWAE0038E No se puede abrir el directorio {0}
not_a_dir_EXC_=IWAE0039E No se puede abrir el directorio ya que el archivo no es un directorio: {0}
inferred_dds_EXC_=IWAE0040E Se ha inferido que el archivo JAR EJB "{0}" es de la versi\u00f3n 1.0 ya que el manifiesto no declara beans de empresa pero existen descriptores de despliegue serializados en el JAR.
filename_exception_EXC_=IWAE0041E Nombre de archivo: {0}; Excepci\u00f3n: {1}
no_dds_10_EXC_=IWAE0042E No hay descriptores de despliegue en el archivo JAR EJB 1.0: {0}
manifest_dd_load_EXC_=IWAE0043E El manifiesto de JAR declara un bean de empresa para el que el archivo de descriptor de despliegue no puede cargarse: {0}
manifest_dd_find_EXC_=IWAE0044E El manifiesto de JAR declara un bean de empresa para el que el archivo de descriptor de despliegue no puede encontrarse: {0}
io_ex_reading_dd_EXC_=IWAE0045E Se ha producido una excepci\u00f3n de E/S al leer {0}
ser_not_dd_EXC_=IWAE0046E El objeto serializado del archivo "{0}"  no es una instancia de javax.ejb.deployment.DeploymentDescriptor
reading_dd_EXC_=IWAE0047E Se ha producido una excepci\u00f3n al leer {0}
missing_class_EXC_=IWAE0048E No se ha podido deserializar {0} ya que no se ha podido encontrar una clase necesaria.  Excepci\u00f3n: {1}
Converted=Convertido
Stack_trace_of_nested_exce_EXC_=IWAE0049E Rastreo de pila de excepci\u00f3n anidada:
IOException_occurred_while_EXC_=IWAE0050E Se ha producido una excepci\u00f3n de E/S al copiar el manifiesto
Extract_destination_is_the_EXC_=IWAE0051E El destino de la extracci\u00f3n es la misma v\u00eda de acceso que el archivo fuente
Parameter_should_not_be_nu_EXC_=IWAE0052E El par\u00e1metro no debe ser nulo
Archive_is_not_a_valid_EJB_EXC_=IWAE0055E El archivador no es un archivo JAR EJB (1.0) v\u00e1lido ya que no se han podido encontrar descriptores de despliegue serializados, ya sea en el manifiesto o en las entradas con una extensi\u00f3n ".ser"
_The_following_files_could_EXC_=IWAE0056E No se han podido cargar los siguientes archivos:
FixPrimKeyCommand_failed_-_EXC_=IWAE0057E FixPrimKeyCommand ha fallado - rastreo de pila de excepci\u00f3n:
FixPrimKeyCommand_usage___=Uso de FixPrimKeyCommand:  <sourceJarFilePath> [destinationPath]
FixPrimKeyCommand_usage__s_EXC_=IWAE0058E Uso de FixPrimKeyCommand: sourceJarFilePath debe apuntar a un archivo JAR EJB v\u00e1lido o a un directorio de un archivo JAR EJB inflado
Repair_command_failed_-_ex_EXC_=IWAE0059E El mandato de reparaci\u00f3n ha fallado - rastreo de pila de excepci\u00f3n:
Repairs_all_entries_in_the=Repara todas las entradas de los directorios META-INF y/o WEB-INF para que tengan las may\u00fasculas y min\u00fasculas correctas
RepairArchiveCommand_usage=Uso de RepairArchiveCommand:  <sourceJarFilePath> <destinationPath>
RepairArchiveCommand_usage1_ERROR_=IWAE0060E Uso de RepairArchiveCommand: sourceJarFilePath debe apuntar a un archivador v\u00e1lido o a un directorio de un archivador inflado
Application_Client_Jar_Fil=Archivo JAR de cliente de aplicaciones
EAR_File=Archivo EAR
EJB_Jar_File=Archivo JAR EJB
RAR_File=Archivo RAR
WAR_File=Archivo WAR
Error_occurred_iterating_f_EXC_=IWAE0061E Se ha producido un error al iterar archivos
End_of_list_reached_EXC_=IWAE0062E Se ha llegado al final de la lista
Internal_Error__Iterator_o_EXC_=IWAE0063E Error interno: El iterador est\u00e1 desincronizado con las entradas zip
Error_iterating_the_archiv_EXC_=IWAE0064E Error al iterar el archivador
Absolute_path_unknown_EXC_=IWAE0065E V\u00eda de acceso absoluta desconocida
Original_archive_is_not_a__EXC_=IWAE0066E El archivador original no es un directorio
Null_uri_EXC_=IWAE0067E Uri nulo
Module_file=Archivo de m\u00f3dulo
A_WAR_file=Archivo WAR
An_EJB_JAR_file=Archivo JAR EJB
An_Application_Client_JAR_file=Archivo JAR de cliente de aplicaciones
A_RAR_file=Archivo RAR
A_Application_file=Archivo de aplicaci\u00f3n
A_file_does_not_exist_for_module=No existe ning\u00fan archivo para el elemento del m\u00f3dulo que tiene el uri: {0}
File_not_correct_type=El archivo {0} del archivo EAR {1} no es el tipo correcto de acuerdo con el descriptor de despliegue de aplicaci\u00f3n.  Tipo esperado: {2}";
Module_not_in_EAR=El m\u00f3dulo no est\u00e1 en un EAR: {0}
Module_file_does_not_exist_2=El archivo de m\u00f3dulo no existe para la referencia del m\u00f3dulo.  M\u00f3dulo = {0}
FileImpl._Error_0=La contenci\u00f3n recurrente no est\u00e1 permitida para
